import { useEffect, useState } from "react";
import QLink, { QLinkType } from "../../components/UI/Link/QLink"
import { Paths } from "../../utils/constants"
import { StyledStart } from "./styled"
import { useStore } from "../../store";

const Start = () => {
  const { clearAll } = useStore();
  useEffect(() => {
    clearAll();
  }, [])

  const [disabled, setDisabled] = useState(true);

  return (
    <StyledStart>
      <div>
        <h2>Знай свою версию</h2>
        <p>Вы всегда хотели узнать, какая версия Нефе: 1.0, 2.0, 3.0 или 3.1, духовно ближе именно вам, но боялись <s>ковра</s> спросить?</p>
        <p>Теперь, благодаря этому экспресс-тесту, правду можно выяснить быстро и почти безболезненно. Кликайте на картинки - и становитесь ближе к истине!</p>
        <p>Приготовьте чашечку свежего топлива, и...</p>
    
        <div className="note">
          <p>Автор теста не несет ответственности за внезапно возникшее желание: почистить ковер, расставить всю посуду на кухне по фен-шую,
            истребить несколько краснокнижных видов рептилий, сладких <s>душ</s> апельсинов и убить соседей, что мешают спать,
            перечитать "Золотую ветвь", перечитать "Морфологию волшебной сказки", перечитать РоманТМ и РоманII, подарить культуру ксенопырам,
            пожмякать крысоголубя, утопиться в антисептике, пять часов плакать в душе, пахнуть лемонграссом, централизовать феодальное государство,
            получить Великое Тайненькое Знаньице, сдаться санитарам, не сдаваться санитарам, люто душнить, завернуться в пафосный халат, съесть крабовый салат, сжечь что-нибудь напалмом, завести собаку,
            завести ученика, завести собаку-ученика, развести ученика как лоха, кросиво страдать, асуждать свитера, асуждать шаурму,
            асуждать семки, выйти погулять в открытый космос, а также уничтожить все живые существа путем их приведения в нирвану.
          </p>
          <div className="agreement">
            <label><input type="checkbox" onChange={(e) => setDisabled(!e.target.checked)}/>Я достаточно Нефе, чтобы прочитать условия мелким шрифтом!</label>
            {!disabled &&
              <QLink
              path={`${Paths.QUESTION}1`}
              type={QLinkType.PRIMARY}
              text="Тогда начнем"
              />
            }
          </div>
        </div>
      </div>
    </StyledStart>
  )
  
}

export default Start