import { useEffect, useState } from "react";
import QLink, { QLinkType } from "../../components/UI/Link/QLink"
import { Paths } from "../../utils/constants"
import { StyledStart } from "./styled"
import { useStore } from "../../store";

const headerText = "Это разные Нефе! (с)";
const btnText = "Nat 20, let's go!";

const Start = () => {
  const { clearAll } = useStore();
  useEffect(() => {
    clearAll();
  }, [])

  const [disabled, setDisabled] = useState(true);

  return (
    <StyledStart>
      <div>
        <h2>{headerText}</h2>
        <p>...Вы всегда хотели узнать, какая версия Нефе: 1.0, 2.0, 3.0 или 3.1, духовно ближе именно вам, но боялись <s>ковра</s> спросить?</p>
        <p>Теперь, благодаря этому экспресс-тесту, правду можно выяснить быстро и почти безболезненно. Кликайте на картинки - и становитесь ближе к истине!</p>
        <p>Приготовьте чашечку свежего топлива - и начнем.</p>
    
        <div>
          <p className="note">Автор теста не несет ответственности за внезапно возникшее желание: почистить ковер, расставить всю посуду на кухне по фен-шую,
            истребить несколько краснокнижных видов рептилий, сладких <s>душ</s> апельсинов и убить соседей, что мешают спать,
            перечитать "Золотую ветвь", перечитать "Морфологию волшебной сказки", перечитать РоманТМ и РоманII, погладить пырпыра,
            пожмякать крысоголубя, утопиться в антисептике, пять часов плакать в душе, пахнуть лемонграссом, централизовать феодальное государство,
            получить Великое Тайненькое Знаньице, сдаться санитарам, не сдаваться санитарам, завернуться в пафосный халат, съесть крабовый салат, сжечь что-нибудь напалмом, завести собаку,
            завести ученика, завести собаку-ученика, развести ученика, кросиво страдать, асуждать свитера, асуждать шаурму,
            асуждать семки, а также уничтожить все живые существа путем их приведения в нирвану.
          </p>
          <label><input type="checkbox" onChange={(e) => setDisabled(!e.target.checked)}/>Окэээй...</label>
        </div>
      </div>
      {!disabled &&
        <QLink
        path={`${Paths.QUESTION}1`}
        type={QLinkType.PRIMARY}
        text={btnText}
      />
      }
    </StyledStart>
  )
  
}

export default Start