import { Answer, Char, Question, Result } from "./types";

export enum Paths {
  START = "/",
  QUESTION = "/question/",
  FINISH = "/thatsallfolks",
}

export const QUESTIONS: Question[] = [
  { id: 1, text: "Выберите халат" },
  { id: 2, text: "Выберите ковер" },
  { id: 3, text: "Выберите кота" },
  { id: 4, text: "Выберите книгу" },
  { id: 5, text: "Выберите блюдо" },
];

export const ANSWERS: Answer[][] = [
  [
    {
      id: 1,
      text: "Я возьму это кимоно. И эту катану",
      image: "/khalat/1.jpg",
      char: Char.NEF,
    },
    {
      text: "Конечно, ханьфу: и в пир, и в мир, и в ритуальное жертвоприношение!",
      image: "/khalat/2.jpg",
      char: Char.NEI,
      id: 2,
    },
    {
      text: "Просто дайте что-нибудь потеплее... и попафоснее",
      image: "/khalat/3.jpg",
      char: Char.UNO,
      id: 3,
    },
    {
      text: "Деньги - бумага, я в Баленсиага!",
      image: "/khalat/4.webp",
      char: Char.SEL,
      id: 4,
    },
    {
      text: 'Кто-то сказал "халат"? :3',
      image: "/khalat/5.jpg",
      char: Char.LAR,
      id: 5,
    },
  ],
  [
    {
      id: 1,
      text: "Хм... Вот у этого цвет удачный",
      image: "/kover/car1.jpg",
      char: Char.NEF,
    },
    {
      id: 2,
      text: "Мм, ковер, внушающий уважение!",
      image: "/kover/car2.jpg",
      char: Char.NEI,
    },
    {
      id: 3,
      text: "Я ни на что не намекаю...",
      image: "/kover/car3.jpg",
      char: Char.UNO,
    },
    {
      id: 4,
      text: "Ну разве не мимими?",
      image: "/kover/car4.jpg",
      char: Char.SEL,
    },
    {
      id: 5,
      text: "Вот, норм экземпляр, есть, что посмотреть!",
      image: "/kover/car5.jpg",
      char: Char.LAR,
    },
  ],
  [
    {
      text: "*источает презрение*",
      image: "/kot/1.gif",
      char: Char.NEF,
      id: 0,
    },
    {
      text: "*смеется на злодейском в историческом антураже*",
      image: "/kot/2.gif",
      char: Char.NEI,
      id: 0,
    },
    {
      text: "*руками не трогать*",
      image: "/kot/3.jpg",
      char: Char.UNO,
      id: 0,
    },
    {
      text: "*смеется на архизлодейском в историческом антураже*",
      image: "/kot/4.gif",
      char: Char.SEL,
      id: 0,
    },
    {
      text: "Пушиночка!",
      image: "/kot/5.jpg",
      char: Char.LAR,
      id: 0,
    },
  ],
  [
    {
      text: '"Воспоминания о прошлом Земли" Лю Цысиня. Меня развлекают чужие этические страдания',
      image: "/kniga/1.jpg",
      char: Char.NEF,
      id: 0,
    },
    {
      text: '"Эпос о Гильгамеше". Зачем? Во славу с... Кхм. Для общего образования, разумеется!',
      image: "/kniga/2.jpg",
      char: Char.NEI,
      id: 0,
    },
    {
      text: '"Пиранези" Сюзанны Кларк. Мне близки бродилки в лиминальных пространствах',
      image: "/kniga/3.jpg",
      char: Char.UNO,
      id: 0,
    },
    {
      text: '"Токийский зодиак" Содзи Симата. Неплохая логическая задачка, и способ ковровизации интересный.',
      image: "/kniga/4.jpg",
      char: Char.SEL,
      id: 0,
    },
    {
      text: '"Полиция памяти" Ёко Огавы. Тлен, БЗСХДНСТ и кросивое - все, как я люблю!',
      image: "/kniga/5.jpg",
      char: Char.LAR,
      id: 0,
    },
  ],
  [
    {
      text: 'Питательная смесь, чтобы быстрее покончить с этим неприятным процессом... Нет, это не смузи. Нет. Вы ничего не докажете',
      image: "/snak/1.jpg",
      char: Char.NEF,
      id: 0,
    },
    {
      text: 'Может быть, это сашими из фугу. Может быть, нет. Не попробуешь - не узнаешь. Итадакимасу!',
      image: "/snak/2.jpg",
      char: Char.NEI,
      id: 0,
    },
    {
      text: 'Мне все равно, что это. Нет, я не хочу знать, из чего оно сделано. Меньше знаешь - крепче спишь (поэтому я никогда не сплю Т__Т)',
      image: "/snak/3.webp",
      char: Char.UNO,
      id: 0,
    },
    {
      text: 'Что может быть лучше тортика, приготовленного собственными руками? :3',
      image: "/snak/4.jpg",
      char: Char.SEL,
      id: 0,
    },
    {
      text: 'Что значит "не еда"? Тут даже фруктик сверху, для ЗОЖности!',
      image: "/snak/5.jpg",
      char: Char.LAR,
      id: 0,
    },
  ],
];


export const RESULTS: Result[] = [
  { id: Char.NEF,
    name: "Нефермаат",
    text: "Неподражаемый оригинал, версия 1.0. Стильный ударопрочный корпус в классическом дизайне семьи Маат, многоядерный мозг (с точкой доступа для Кекуит), неиссякаемый запас звездочек и энергии на упорядочивание окружающего пространства. Даже если оно орет и вырывается. Особенно если оно орет и вырывается... Отпустите крысоголубя, это же ле фу!"
  },
  { id: Char.NEI,
    name: "Нейт",
    text: "Улучшенная версия 2.0: теперь магическая! Жнец душ, чтец volumes of forgotten lore, игрец на чувствах Сатхатхор, а еще основатель собственной академии волшебства (где с учениками не происходит ничего плохого... проверьте отзывы, никто не жаловался!), собственной религии и собственного карманного государства. Это вам не ложки по фен-шую раскладывать!"
  },
  { id: Char.UNO,
    name: "Ун-Нефер",
    text: "Очевидно, лучшая из всех возможных, версия 3.0: единственная со встроенным моральным компасом. Да, иногда он показывает в сторону массовых жертвоприношений, но это ради высшего блага! И нет, вы не получаете удовольствия от всеобщего поклонения, почитания и около-божественной власти... но ради дела готовы потерпеть. Да, да, вы настолько альтруистичны."
  },
  { id: Char.SEL,
    name: "Селкет-Маат",
    text: "Пока все остальные версии выясняют, кто из них лучше, вы просто улыбаетесь, машете и тихонько вершите злодейства. Вам уже не надо ничего никому доказывать. Вы не версия 3.1: you are the final form."
  },
  { id: Char.LAR,
    name: "вообще не Нефе!",
    text: "Как ты пробралось сюда, жалкое подобие в пырпыровых тапочках? Брысь, брысь! Иди уроки учи... Что значит - уже не в школе? А как насчет школы жизни? Знаешь, какой у нее главный урок? Вот именно, боаль! Ну и еще, не халат красит бисенена, а бисенен - халат, но это уже для уровня advanced."
  },
];